In [2]:
import pandas as pd
import numpy as np

In [3]:
pd.__version__

'1.4.2'

In [4]:
games_url = 'http://andybek.com/pandas-games'

In [5]:
games = pd.read_csv(games_url)
games.head(n=6)

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,Kinect Adventures!,X360,2010.0,Misc,Microsoft Game Studios,14.97,4.94,0.24,1.67,21.82
1,Grand Theft Auto V,PS3,2013.0,Action,Take-Two Interactive,7.01,9.27,0.97,4.14,21.40
2,Grand Theft Auto V,X360,2013.0,Action,Take-Two Interactive,9.63,5.31,0.06,1.38,16.38
3,Call of Duty: Modern Warfare 3,X360,2011.0,Shooter,Activision,9.03,4.28,0.13,1.32,14.76
4,Call of Duty: Black Ops,X360,2010.0,Shooter,Activision,9.67,3.73,0.11,1.13,14.64
5,Call of Duty: Black Ops 3,PS4,2015.0,Shooter,Activision,5.77,5.81,0.35,2.31,14.24

In [6]:
games.sort_values(by='JP_Sales', ascending=False).head(n=21)

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
58,Final Fantasy XIII,PS3,2009.0,Role-Playing,Square Enix,1.74,1.24,1.87,0.52,5.36
64,Resident Evil 5,PS3,2009.0,Action,Capcom,1.96,1.43,1.08,0.65,5.11
1,Grand Theft Auto V,PS3,2013.0,Action,Take-Two Interactive,7.01,9.27,0.97,4.14,21.40
181,Final Fantasy XIII-2,PS3,2011.0,Role-Playing,Square Enix,0.78,0.75,0.89,0.26,2.68
136,Resident Evil 6,PS3,2012.0,Shooter,Capcom,0.88,0.97,0.88,0.42,3.15
488,One Piece: Pirate Warriors,PS3,2012.0,Action,Namco Bandai Games,0.01,0.24,0.86,0.09,1.20
48,Metal Gear Solid 4: Guns of the Patriots,PS3,2008.0,Action,Konami Digital Entertainment,2.63,1.74,0.83,0.83,6.03
14,Gran Turismo 5,PS3,2010.0,Racing,Sony Computer Entertainment,2.96,4.88,0.81,2.12,10.77
513,Hot Shots Golf: Out of Bounds,PS3,2007.0,Sports,Sony Computer Entertainment,0.31,0.03,0.76,0.04,1.14
311,Dragon's Dogma,PS3,2012.0,Role-Playing,Capcom,0.41,0.46,0.72,0.19,1.78
474,Tales of Xillia,PS3,2011.0,Role-Playing,Namco Bandai Games,0.29,0.19,0.67,0.09,1.24
6,Call of Duty: Black Ops II,PS3,2012.0,Shooter,Activision,4.99,5.88,0.65,2.52,14.03
619,Yakuza 4,PS3,NaN,Action,Sega,0.15,0.14,0.63,0.05,0.97
520,Yakuza 3,PS3,2009.0,Action,Sega,0.21,0.21,0.62,0.08,1.13
986,Yakuza 5,PS3,2012.0,Action,Sega,0.00,0.00,0.59,0.00,0.59
90,Street Fighter IV,PS3,2009.0,Fighting,Capcom,2.02,1.06,0.58,0.53,4.19
952,Warriors Orochi 3,PS3,2011.0,Action,Ubisoft Annecy,0.00,0.04,0.57,0.01,0.62
88,Gran Turismo 5 Prologue,PS3,2007.0,Racing,Sony Computer Entertainment,1.28,1.83,0.57,0.53,4.20
239,Pro Evolution Soccer 2012,PS3,2011.0,Action,Konami Digital Entertainment,0.34,0.97,0.55,0.33,2.19
897,Fist of the North Star: Ken's Rage,PS3,2010.0,Action,Ubisoft Annecy,0.06,0.03,0.55,0.02,0.66
1058,Kidou Senshi Gundam: Extreme VS,PS3,2011.0,Fighting,Namco Bandai Games,0.00,0.00,0.54,0.00,0.54

In [7]:
games.describe()

,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
count,3088.000000,3143.000000,3143.000000,3143.000000,3143.000000,3143.000000
mean,2011.174223,0.373306,0.252510,0.034063,0.089962,0.749908
std,2.877156,0.801483,0.570164,0.093115,0.203866,1.500717
min,2005.000000,0.000000,0.000000,0.000000,0.000000,0.010000
25%,2009.000000,0.040000,0.010000,0.000000,0.010000,0.100000
50%,2011.000000,0.140000,0.070000,0.000000,0.030000,0.270000
75%,2014.000000,0.360000,0.250000,0.030000,0.090000,0.770000
max,2017.000000,14.970000,9.270000,1.870000,4.140000,21.820000

In [8]:
games.sum()

C:\Users\Tom\AppData\Local\Temp\ipykernel_3620\1599516262.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  games.sum()

Name            Kinect Adventures!Grand Theft Auto VGrand Thef...
Platform        X360PS3X360X360X360PS4PS3X360X360PS3PS3X360PS4...
Year                                                    6210506.0
Genre           MiscActionActionShooterShooterShooterShooterSh...
NA_Sales                                                   1173.3
EU_Sales                                                   793.64
JP_Sales                                                   107.06
Other_Sales                                                282.75
Global_Sales                                              2356.96
dtype: object

# 196. Simple aggregations Review

In [9]:
# previously aggregates: mean, sum, std, var

In [10]:
# What are the total sales across all regions?

In [11]:
games.columns.shape
country_sales = games.columns[5:10].values
games.loc[:,country_sales]

      NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
0        14.97      4.94      0.24         1.67         21.82
1         7.01      9.27      0.97         4.14         21.40
2         9.63      5.31      0.06         1.38         16.38
3         9.03      4.28      0.13         1.32         14.76
4         9.67      3.73      0.11         1.13         14.64
...        ...       ...       ...          ...           ...
3138      0.00      0.01      0.00         0.00          0.01
3139      0.01      0.00      0.00         0.00          0.01
3140      0.01      0.00      0.00         0.00          0.01
3141      0.00      0.01      0.00         0.00          0.01
3142      0.00      0.01      0.00         0.00          0.01

[3143 rows x 5 columns]

In [12]:
games.loc[:,country_sales].sum()

NA_Sales        1173.30
EU_Sales         793.64
JP_Sales         107.06
Other_Sales      282.75
Global_Sales    2356.96
dtype: float64

In [13]:
games.columns.shape

(10,)

In [14]:
games.columns.shape[0]

10

In [15]:
games.head(n=1)

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,Kinect Adventures!,X360,2010.0,Misc,Microsoft Game Studios,14.97,4.94,0.24,1.67,21.82

In [16]:
games.columns

Index(['Name', 'Platform', 'Year', 'Genre', 'Publisher', 'NA_Sales',
       'EU_Sales', 'JP_Sales', 'Other_Sales', 'Global_Sales'],
      dtype='object')

In [17]:
list_columns = list(games.columns.values)

In [18]:
list_columns

['Name',
 'Platform',
 'Year',
 'Genre',
 'Publisher',
 'NA_Sales',
 'EU_Sales',
 'JP_Sales',
 'Other_Sales',
 'Global_Sales']

In [19]:
list_columns.index('NA_Sales')

5

In [20]:
list_columns[list_columns.index('NA_Sales'):]

['NA_Sales', 'EU_Sales', 'JP_Sales', 'Other_Sales', 'Global_Sales']

In [21]:
type(list_columns[list_columns.index('NA_Sales'):])

list

In [22]:
index_my_countrys = list_columns[list_columns.index('NA_Sales'):]
type(index_my_countrys)

list

In [23]:
index_my_countrys

['NA_Sales', 'EU_Sales', 'JP_Sales', 'Other_Sales', 'Global_Sales']

In [24]:
games.loc[:,index_my_countrys]

      NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
0        14.97      4.94      0.24         1.67         21.82
1         7.01      9.27      0.97         4.14         21.40
2         9.63      5.31      0.06         1.38         16.38
3         9.03      4.28      0.13         1.32         14.76
4         9.67      3.73      0.11         1.13         14.64
...        ...       ...       ...          ...           ...
3138      0.00      0.01      0.00         0.00          0.01
3139      0.01      0.00      0.00         0.00          0.01
3140      0.01      0.00      0.00         0.00          0.01
3141      0.00      0.01      0.00         0.00          0.01
3142      0.00      0.01      0.00         0.00          0.01

[3143 rows x 5 columns]

In [25]:
games.loc[:,index_my_countrys].max(axis=0)

NA_Sales        14.97
EU_Sales         9.27
JP_Sales         1.87
Other_Sales      4.14
Global_Sales    21.82
dtype: float64

In [26]:
games.loc[:,index_my_countrys].max(axis=1)

0       21.82
1       21.40
2       16.38
3       14.76
4       14.64
        ...
3138     0.01
3139     0.01
3140     0.01
3141     0.01
3142     0.01
Length: 3143, dtype: float64

# 197. Conditional Agregates

In [27]:

games.loc[:,index_my_countrys].max(axis=0)

NA_Sales        14.97
EU_Sales         9.27
JP_Sales         1.87
Other_Sales      4.14
Global_Sales    21.82
dtype: float64

In [28]:
14.97 + 9.27 + 1.87 + 4.14 - 21.82

8.430000000000003

In [29]:
games.Platform.unique()

array(['X360', 'PS3', 'PS4', 'XOne'], dtype=object)

In [30]:
# Q: find the total sales by region for x360 and PS3

In [31]:
games.head()

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,Kinect Adventures!,X360,2010.0,Misc,Microsoft Game Studios,14.97,4.94,0.24,1.67,21.82
1,Grand Theft Auto V,PS3,2013.0,Action,Take-Two Interactive,7.01,9.27,0.97,4.14,21.40
2,Grand Theft Auto V,X360,2013.0,Action,Take-Two Interactive,9.63,5.31,0.06,1.38,16.38
3,Call of Duty: Modern Warfare 3,X360,2011.0,Shooter,Activision,9.03,4.28,0.13,1.32,14.76
4,Call of Duty: Black Ops,X360,2010.0,Shooter,Activision,9.67,3.73,0.11,1.13,14.64

In [32]:
#    1145 # ugly hack for GH #836
#    1146 if self._multi_take_opportunity(tup):
# -> 1147     return self._multi_take(tup)
#    1149 return self._getitem_tuple_same_dim(tup)

sales = games.loc[:,['Platform'] + index_my_countrys]

In [33]:
sales

     Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
0        X360     14.97      4.94      0.24         1.67         21.82
1         PS3      7.01      9.27      0.97         4.14         21.40
2        X360      9.63      5.31      0.06         1.38         16.38
3        X360      9.03      4.28      0.13         1.32         14.76
4        X360      9.67      3.73      0.11         1.13         14.64
...       ...       ...       ...       ...          ...           ...
3138     X360      0.00      0.01      0.00         0.00          0.01
3139     XOne      0.01      0.00      0.00         0.00          0.01
3140     XOne      0.01      0.00      0.00         0.00          0.01
3141      PS4      0.00      0.01      0.00         0.00          0.01
3142     XOne      0.00      0.01      0.00         0.00          0.01

[3143 rows x 6 columns]

In [34]:
sales.sum()

Platform        X360PS3X360X360X360PS4PS3X360X360PS3PS3X360PS4...
NA_Sales                                                   1173.3
EU_Sales                                                   793.64
JP_Sales                                                   107.06
Other_Sales                                                282.75
Global_Sales                                              2356.96
dtype: object

In [35]:
sales.sum(axis=0)

Platform        X360PS3X360X360X360PS4PS3X360X360PS3PS3X360PS4...
NA_Sales                                                   1173.3
EU_Sales                                                   793.64
JP_Sales                                                   107.06
Other_Sales                                                282.75
Global_Sales                                              2356.96
dtype: object

In [36]:
sales.sum(axis=1)

C:\Users\Tom\AppData\Local\Temp\ipykernel_3620\2518183184.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  sales.sum(axis=1)

0       43.64
1       42.79
2       32.76
3       29.52
4       29.28
        ...
3138     0.02
3139     0.02
3140     0.02
3141     0.02
3142     0.02
Length: 3143, dtype: float64

In [37]:
sales.sum(numeric_only=True)

NA_Sales        1173.30
EU_Sales         793.64
JP_Sales         107.06
Other_Sales      282.75
Global_Sales    2356.96
dtype: float64

In [38]:
type(sales.sum(numeric_only=True))

pandas.core.series.Series

In [39]:
list(sales.sum(numeric_only=True))

[1173.3, 793.64, 107.06, 282.75, 2356.96]

In [40]:
sales_check = list(sales.sum(numeric_only=True))

In [41]:
sales_region_sum  = 0 

for i in sales_check:
    if i != sales_check[-1]:
        sales_region_sum += i

sales_region_sum - sales_check[-1]

-0.21000000000003638

In [42]:
sales.loc[games.Platform == 'X360'].sum(numeric_only=True)

NA_Sales        601.05
EU_Sales        280.58
JP_Sales         12.43
Other_Sales      85.54
Global_Sales    979.96
dtype: float64

In [43]:
sales.loc[games.Platform == 'PS3'].sum(numeric_only=True)

NA_Sales        392.26
EU_Sales        343.71
JP_Sales         79.99
Other_Sales     141.93
Global_Sales    957.84
dtype: float64

# 198. The split-apply-combine pattern

In [44]:
# 1. Separate the data
sales.loc[games.Platform == 'X360']
sales.loc[games.Platform == 'PS3']

     Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
1         PS3      7.01      9.27      0.97         4.14         21.40
6         PS3      4.99      5.88      0.65         2.52         14.03
9         PS3      5.54      5.82      0.49         1.62         13.46
10        PS3      5.98      4.44      0.48         1.83         12.73
14        PS3      2.96      4.88      0.81         2.12         10.77
...       ...       ...       ...       ...          ...           ...
3124      PS3      0.00      0.01      0.00         0.00          0.01
3125      PS3      0.00      0.00      0.01         0.00          0.01
3129      PS3      0.00      0.00      0.01         0.00          0.01
3132      PS3      0.00      0.00      0.01         0.00          0.01
3136      PS3      0.00      0.00      0.01         0.00          0.01

[1329 rows x 6 columns]

In [45]:
# 2. Calculate sume
sales.loc[games.Platform == 'X360'].sum(numeric_only=True)
sales.loc[games.Platform == 'PS3'].sum(numeric_only=True)

NA_Sales        392.26
EU_Sales        343.71
JP_Sales         79.99
Other_Sales     141.93
Global_Sales    957.84
dtype: float64

# 199. the groupby() method

In [46]:
sales

     Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
0        X360     14.97      4.94      0.24         1.67         21.82
1         PS3      7.01      9.27      0.97         4.14         21.40
2        X360      9.63      5.31      0.06         1.38         16.38
3        X360      9.03      4.28      0.13         1.32         14.76
4        X360      9.67      3.73      0.11         1.13         14.64
...       ...       ...       ...       ...          ...           ...
3138     X360      0.00      0.01      0.00         0.00          0.01
3139     XOne      0.01      0.00      0.00         0.00          0.01
3140     XOne      0.01      0.00      0.00         0.00          0.01
3141      PS4      0.00      0.01      0.00         0.00          0.01
3142     XOne      0.00      0.01      0.00         0.00          0.01

[3143 rows x 6 columns]

In [47]:
# Q: find the total sales by region for X360 and PS3.

In [48]:
sales.groupby('Platform').sum()

          NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
Platform
PS3         392.26    343.71     79.99       141.93        957.84
PS4          96.80    123.70     14.30        43.36        278.10
X360        601.05    280.58     12.43        85.54        979.96
XOne         83.19     45.65      0.34        11.92        141.06

In [49]:
# Q: how much does each platform sell across regions, on average.

In [50]:
sales.groupby('Platform').mean()

          NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
Platform
PS3       0.295154  0.258623  0.060188     0.106795      0.720722
PS4       0.288095  0.368155  0.042560     0.129048      0.827679
X360      0.475138  0.221802  0.009826     0.067621      0.774672
XOne      0.390563  0.214319  0.001596     0.055962      0.662254

In [51]:
sales.groupby('Platform').describe()

         NA_Sales                                                    EU_Sales  \
            count      mean       std  min   25%   50%    75%    max    count
Platform
PS3        1329.0  0.295154  0.578325  0.0  0.01  0.12  0.320   7.01   1329.0
PS4         336.0  0.288095  0.594151  0.0  0.00  0.07  0.305   5.77    336.0
X360       1265.0  0.475138  1.031488  0.0  0.08  0.17  0.450  14.97   1265.0
XOne        213.0  0.390563  0.641796  0.0  0.03  0.15  0.390   4.52    213.0

                    ... Other_Sales       Global_Sales                      \
              mean  ...         75%   max        count      mean       std
Platform            ...
PS3       0.258623  ...        0.11  4.14       1329.0  0.720722  1.412850
PS4       0.368155  ...        0.13  2.31        336.0  0.827679  1.618966
X360      0.221802  ...        0.07  1.67       1265.0  0.774672  1.618906
XOne      0.214319  ...        0.06  0.67        213.0  0.662254  1.039298


           min   25%   50%   75%    max
Platform
PS3       0.01  0.11  0.28  0.77  21.40
PS4       0.01  0.06  0.22  0.82  14.24
X360      0.01  0.11  0.28  0.77  21.82
XOne      0.01  0.07  0.24  0.68   7.30

[4 rows x 40 columns]

In [52]:
sales.groupby('Platform').median()

          NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
Platform
PS3           0.12      0.07      0.01         0.03          0.28
PS4           0.07      0.08      0.02         0.03          0.22
X360          0.17      0.06      0.00         0.02          0.28
XOne          0.15      0.07      0.00         0.02          0.24

200. Customizing index to group mappings

In [53]:
sales.groupby('Platform').sum() # + .mean(), .median()

          NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
Platform
PS3         392.26    343.71     79.99       141.93        957.84
PS4          96.80    123.70     14.30        43.36        278.10
X360        601.05    280.58     12.43        85.54        979.96
XOne         83.19     45.65      0.34        11.92        141.06

In [54]:
sales.groupby('Platform')

In [55]:
len(sales.groupby('Platform'))

4

# 201. Bonus Customizing index to group Mappings

In [56]:
sales.groupby('Platform').sum()

          NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
Platform
PS3         392.26    343.71     79.99       141.93        957.84
PS4          96.80    123.70     14.30        43.36        278.10
X360        601.05    280.58     12.43        85.54        979.96
XOne         83.19     45.65      0.34        11.92        141.06

In [57]:
# eqivalent to:

In [58]:
sales.groupby(sales['Platform']).sum()

          NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
Platform
PS3         392.26    343.71     79.99       141.93        957.84
PS4          96.80    123.70     14.30        43.36        278.10
X360        601.05    280.58     12.43        85.54        979.96
XOne         83.19     45.65      0.34        11.92        141.06

In [59]:
sales.Platform.unique()

array(['X360', 'PS3', 'PS4', 'XOne'], dtype=object)

In [60]:
# -> PlayStation, XBox

In [61]:
platform_names = {
    'PS3':'PlayStation',
    'PS4':'PlayStation',
    'X360':'XBox',
    'XOne':'XBox'
}

In [62]:
platform_names

{'PS3': 'PlayStation', 'PS4': 'PlayStation', 'X360': 'XBox', 'XOne': 'XBox'}

In [63]:
sales.set_index('Platform')

          NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
Platform
X360         14.97      4.94      0.24         1.67         21.82
PS3           7.01      9.27      0.97         4.14         21.40
X360          9.63      5.31      0.06         1.38         16.38
X360          9.03      4.28      0.13         1.32         14.76
X360          9.67      3.73      0.11         1.13         14.64
...            ...       ...       ...          ...           ...
X360          0.00      0.01      0.00         0.00          0.01
XOne          0.01      0.00      0.00         0.00          0.01
XOne          0.01      0.00      0.00         0.00          0.01
PS4           0.00      0.01      0.00         0.00          0.01
XOne          0.00      0.01      0.00         0.00          0.01

[3143 rows x 5 columns]

In [64]:
sales.set_index('Platform').groupby(platform_names).sum()

             NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
Platform
PlayStation    489.06    467.41     94.29       185.29       1235.94
XBox           684.24    326.23     12.77        97.46       1121.02

In [65]:
sales

     Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
0        X360     14.97      4.94      0.24         1.67         21.82
1         PS3      7.01      9.27      0.97         4.14         21.40
2        X360      9.63      5.31      0.06         1.38         16.38
3        X360      9.03      4.28      0.13         1.32         14.76
4        X360      9.67      3.73      0.11         1.13         14.64
...       ...       ...       ...       ...          ...           ...
3138     X360      0.00      0.01      0.00         0.00          0.01
3139     XOne      0.01      0.00      0.00         0.00          0.01
3140     XOne      0.01      0.00      0.00         0.00          0.01
3141      PS4      0.00      0.01      0.00         0.00          0.01
3142     XOne      0.00      0.01      0.00         0.00          0.01

[3143 rows x 6 columns]

# 202 - BONUS - Series group()

In [66]:
# epitomize -> be the perfect example of

In [67]:
# groupby -> aplit=apply-combine

In [68]:
games.head(n=3)

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,Kinect Adventures!,X360,2010.0,Misc,Microsoft Game Studios,14.97,4.94,0.24,1.67,21.82
1,Grand Theft Auto V,PS3,2013.0,Action,Take-Two Interactive,7.01,9.27,0.97,4.14,21.40
2,Grand Theft Auto V,X360,2013.0,Action,Take-Two Interactive,9.63,5.31,0.06,1.38,16.38

In [69]:
games.loc[:,['Genre','Global_Sales']].set_index('Genre')

              Global_Sales
Genre
Misc                 21.82
Action               21.40
Action               16.38
Shooter              14.76
Shooter              14.64
...                    ...
Role-Playing          0.01
Platform              0.01
Shooter               0.01
Simulation            0.01
Sports                0.01

[3143 rows x 1 columns]

In [70]:
type(games.loc[:,['Genre','Global_Sales']].set_index('Genre'))

pandas.core.frame.DataFrame

In [71]:
games.loc[:,['Genre','Global_Sales']].set_index('Genre').squeeze()

Genre
Misc            21.82
Action          21.40
Action          16.38
Shooter         14.76
Shooter         14.64
                ...
Role-Playing     0.01
Platform         0.01
Shooter          0.01
Simulation       0.01
Sports           0.01
Name: Global_Sales, Length: 3143, dtype: float64

In [72]:
type(games.loc[:,['Genre','Global_Sales']].set_index('Genre').squeeze())

pandas.core.series.Series

In [73]:
ser = games.loc[:,['Genre','Global_Sales']].set_index('Genre').squeeze()

In [74]:
type(ser)

pandas.core.series.Series

In [75]:
ser.head(n=11)

Genre
Misc       21.82
Action     21.40
Action     16.38
Shooter    14.76
Shooter    14.64
Shooter    14.24
Shooter    14.03
Shooter    13.73
Shooter    13.51
Shooter    13.46
Shooter    12.73
Name: Global_Sales, dtype: float64

In [76]:
ser.groupby('Genre').sum()

Genre
Action          671.40
Adventure        45.34
Fighting         99.69
Misc            154.07
Platform         49.54
Puzzle            1.47
Racing          160.27
Role-Playing    182.53
Shooter         601.52
Simulation       26.55
Sports          348.72
Strategy         15.86
Name: Global_Sales, dtype: float64

In [77]:
ser.groupby('Genre').mean().sort_values(ascending=False)

Genre
Shooter         1.412019
Action          0.751007
Role-Playing    0.715804
Racing          0.687854
Sports          0.681094
Platform        0.651842
Fighting        0.604182
Misc            0.550250
Simulation      0.336076
Adventure       0.298289
Strategy        0.264333
Puzzle          0.133636
Name: Global_Sales, dtype: float64

In [78]:
ser.groupby('Genre')

# 203 Skill Challenge

In [79]:
# 1 Create a smaller datafram from games, selecting only the publisher, genre, platform and NA_Sales columns. Assign thie datafram to the variable publishers.

In [80]:
games.head(n=1)

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,Kinect Adventures!,X360,2010.0,Misc,Microsoft Game Studios,14.97,4.94,0.24,1.67,21.82

In [81]:
publisher_columns = ['Publisher','Genre','Platform','NA_Sales']
publishers = games.loc[:,publisher_columns]
publishers.head(n=3)

                Publisher   Genre Platform  NA_Sales
0  Microsoft Game Studios    Misc     X360     14.97
1    Take-Two Interactive  Action      PS3      7.01
2    Take-Two Interactive  Action     X360      9.63

In [82]:
# 2. From the publishers datafram, find the top 10 games publishers in North America by total sales

In [83]:
publishers.groupby('Publisher').sum().sort_values(by='NA_Sales',ascending=False).head(n=10)

                                        NA_Sales
Publisher
Electronic Arts                           213.38
Activision                                193.16
Take-Two Interactive                      120.99
Microsoft Game Studios                    116.77
Ubisoft                                    98.65
Sony Computer Entertainment                76.35
Warner Bros. Interactive Entertainment     45.24
THQ                                        36.44
Bethesda Softworks                         33.88
Capcom                                     24.74

In [84]:
# 3 Similary, what the gaming platform that has attracted the most sales in North America

In [85]:
publishers.head(n=1)

                Publisher Genre Platform  NA_Sales
0  Microsoft Game Studios  Misc     X360     14.97

In [86]:
publishers.groupby(by='Platform').sum().sort_values(by='NA_Sales',ascending=False)

          NA_Sales
Platform
X360        601.05
PS3         392.26
PS4          96.80
XOne         83.19

# Solution

In [87]:
# 1
publishers_solution = games.loc[:,['Publisher','Genre','Platform','NA_Sales']]
publishers_solution.head()

                Publisher    Genre Platform  NA_Sales
0  Microsoft Game Studios     Misc     X360     14.97
1    Take-Two Interactive   Action      PS3      7.01
2    Take-Two Interactive   Action     X360      9.63
3              Activision  Shooter     X360      9.03
4              Activision  Shooter     X360      9.67

In [88]:
# 2
# - groupby publisher
# - sum of NA_Sales within each group
# - rank in descending order by previous sum
# - look at the top 10
publishers_solution.groupby('Publisher').sum().sort_values(by='NA_Sales',ascending=False).head(n=10)

                                        NA_Sales
Publisher
Electronic Arts                           213.38
Activision                                193.16
Take-Two Interactive                      120.99
Microsoft Game Studios                    116.77
Ubisoft                                    98.65
Sony Computer Entertainment                76.35
Warner Bros. Interactive Entertainment     45.24
THQ                                        36.44
Bethesda Softworks                         33.88
Capcom                                     24.74

In [89]:
# 3
publishers_solution.groupby('Platform').sum().sort_values(by='NA_Sales',ascending=False).iloc[0]

NA_Sales    601.05
Name: X360, dtype: float64

In [90]:
sales.groupby("Platform")

In [91]:
sales.Platform.unique()

array(['X360', 'PS3', 'PS4', 'XOne'], dtype=object)

In [92]:
for i in sales.groupby("Platform"):
    print(i)

('PS3',      Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
1         PS3      7.01      9.27      0.97         4.14         21.40
6         PS3      4.99      5.88      0.65         2.52         14.03
9         PS3      5.54      5.82      0.49         1.62         13.46
10        PS3      5.98      4.44      0.48         1.83         12.73
14        PS3      2.96      4.88      0.81         2.12         10.77
...       ...       ...       ...       ...          ...           ...
3124      PS3      0.00      0.01      0.00         0.00          0.01
3125      PS3      0.00      0.00      0.01         0.00          0.01
3129      PS3      0.00      0.00      0.01         0.00          0.01
3132      PS3      0.00      0.00      0.01         0.00          0.01
3136      PS3      0.00      0.00      0.01         0.00          0.01

[1329 rows x 6 columns])
('PS4',      Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
5         PS4      5.77      5.81      0.35         2.31         14.24
12        PS4      3.80      5.81      0.36         2.02         11.98
24        PS4      1.11      6.06      0.06         1.26          8.49
26        PS4      2.93      3.29      0.22         1.23          7.67
27        PS4      2.80      3.30      0.14         1.37          7.60
...       ...       ...       ...       ...          ...           ...
3091      PS4      0.00      0.00      0.01         0.00          0.01
3101      PS4      0.01      0.00      0.00         0.00          0.01
3106      PS4      0.00      0.00      0.01         0.00          0.01
3137      PS4      0.00      0.00      0.01         0.00          0.01
3141      PS4      0.00      0.01      0.00         0.00          0.01

[336 rows x 6 columns])
('X360',      Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
0        X360     14.97      4.94      0.24         1.67         21.82
2        X360      9.63      5.31      0.06         1.38         16.38
3        X360      9.03      4.28      0.13         1.32         14.76
4        X360      9.67      3.73      0.11         1.13         14.64
7        X360      8.25      4.30      0.07         1.12         13.73
...       ...       ...       ...       ...          ...           ...
3127     X360      0.00      0.01      0.00         0.00          0.01
3128     X360      0.00      0.00      0.01         0.00          0.01
3130     X360      0.01      0.00      0.00         0.00          0.01
3135     X360      0.00      0.00      0.01         0.00          0.01
3138     X360      0.00      0.01      0.00         0.00          0.01

[1265 rows x 6 columns])
('XOne',      Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
30       XOne      4.52      2.09      0.01         0.67          7.30
63       XOne      3.21      1.53      0.01         0.38          5.13
65       XOne      2.66      2.01      0.00         0.41          5.08
84       XOne      2.64      1.20      0.03         0.39          4.26
93       XOne      2.45      1.26      0.01         0.37          4.09
...       ...       ...       ...       ...          ...           ...
3133     XOne      0.00      0.01      0.00         0.00          0.01
3134     XOne      0.00      0.01      0.00         0.00          0.01
3139     XOne      0.01      0.00      0.00         0.00          0.01
3140     XOne      0.01      0.00      0.00         0.00          0.01
3142     XOne      0.00      0.01      0.00         0.00          0.01

[213 rows x 6 columns])

In [93]:
for name, df in sales.groupby("Platform"):
    print("--------------------------------------------------------------------------------")
    print("Subgroup label: ",name)
    print("--------------------------------------------------------------------------------\n")
    print(df,"\n")

--------------------------------------------------------------------------------
Subgroup label:  PS3
--------------------------------------------------------------------------------

     Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
1         PS3      7.01      9.27      0.97         4.14         21.40
6         PS3      4.99      5.88      0.65         2.52         14.03
9         PS3      5.54      5.82      0.49         1.62         13.46
10        PS3      5.98      4.44      0.48         1.83         12.73
14        PS3      2.96      4.88      0.81         2.12         10.77
...       ...       ...       ...       ...          ...           ...
3124      PS3      0.00      0.01      0.00         0.00          0.01
3125      PS3      0.00      0.00      0.01         0.00          0.01
3129      PS3      0.00      0.00      0.01         0.00          0.01
3132      PS3      0.00      0.00      0.01         0.00          0.01
3136      PS3      0.00      0.00      0.01         0.00          0.01

[1329 rows x 6 columns]

--------------------------------------------------------------------------------
Subgroup label:  PS4
--------------------------------------------------------------------------------

     Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
5         PS4      5.77      5.81      0.35         2.31         14.24
12        PS4      3.80      5.81      0.36         2.02         11.98
24        PS4      1.11      6.06      0.06         1.26          8.49
26        PS4      2.93      3.29      0.22         1.23          7.67
27        PS4      2.80      3.30      0.14         1.37          7.60
...       ...       ...       ...       ...          ...           ...
3091      PS4      0.00      0.00      0.01         0.00          0.01
3101      PS4      0.01      0.00      0.00         0.00          0.01
3106      PS4      0.00      0.00      0.01         0.00          0.01
3137      PS4      0.00      0.00      0.01         0.00          0.01
3141      PS4      0.00      0.01      0.00         0.00          0.01

[336 rows x 6 columns]

--------------------------------------------------------------------------------
Subgroup label:  X360
--------------------------------------------------------------------------------

     Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
0        X360     14.97      4.94      0.24         1.67         21.82
2        X360      9.63      5.31      0.06         1.38         16.38
3        X360      9.03      4.28      0.13         1.32         14.76
4        X360      9.67      3.73      0.11         1.13         14.64
7        X360      8.25      4.30      0.07         1.12         13.73
...       ...       ...       ...       ...          ...           ...
3127     X360      0.00      0.01      0.00         0.00          0.01
3128     X360      0.00      0.00      0.01         0.00          0.01
3130     X360      0.01      0.00      0.00         0.00          0.01
3135     X360      0.00      0.00      0.01         0.00          0.01
3138     X360      0.00      0.01      0.00         0.00          0.01

[1265 rows x 6 columns]

--------------------------------------------------------------------------------
Subgroup label:  XOne
--------------------------------------------------------------------------------

     Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
30       XOne      4.52      2.09      0.01         0.67          7.30
63       XOne      3.21      1.53      0.01         0.38          5.13
65       XOne      2.66      2.01      0.00         0.41          5.08
84       XOne      2.64      1.20      0.03         0.39          4.26
93       XOne      2.45      1.26      0.01         0.37          4.09
...       ...       ...       ...       ...          ...           ...
3133     XOne      0.00      0.01      0.00         0.00          0.01
3134     XOne      0.00      0.01      0.00         0.00          0.01
3139     XOne      0.01      0.00      0.00         0.00          0.01
3140     XOne      0.01      0.00      0.00         0.00          0.01
3142     XOne      0.00      0.01      0.00         0.00          0.01

[213 rows x 6 columns]

# 206. Handpicking Subgroups

In [94]:
line = '----------------------------------------------------------------------'
for name, df in sales.groupby("Platform"):
    print(line)
    print('Subgroup label: ', name)
    print(line)
    print(df, '\n')

----------------------------------------------------------------------
Subgroup label:  PS3
----------------------------------------------------------------------
     Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
1         PS3      7.01      9.27      0.97         4.14         21.40
6         PS3      4.99      5.88      0.65         2.52         14.03
9         PS3      5.54      5.82      0.49         1.62         13.46
10        PS3      5.98      4.44      0.48         1.83         12.73
14        PS3      2.96      4.88      0.81         2.12         10.77
...       ...       ...       ...       ...          ...           ...
3124      PS3      0.00      0.01      0.00         0.00          0.01
3125      PS3      0.00      0.00      0.01         0.00          0.01
3129      PS3      0.00      0.00      0.01         0.00          0.01
3132      PS3      0.00      0.00      0.01         0.00          0.01
3136      PS3      0.00      0.00      0.01         0.00          0.01

[1329 rows x 6 columns]

----------------------------------------------------------------------
Subgroup label:  PS4
----------------------------------------------------------------------
     Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
5         PS4      5.77      5.81      0.35         2.31         14.24
12        PS4      3.80      5.81      0.36         2.02         11.98
24        PS4      1.11      6.06      0.06         1.26          8.49
26        PS4      2.93      3.29      0.22         1.23          7.67
27        PS4      2.80      3.30      0.14         1.37          7.60
...       ...       ...       ...       ...          ...           ...
3091      PS4      0.00      0.00      0.01         0.00          0.01
3101      PS4      0.01      0.00      0.00         0.00          0.01
3106      PS4      0.00      0.00      0.01         0.00          0.01
3137      PS4      0.00      0.00      0.01         0.00          0.01
3141      PS4      0.00      0.01      0.00         0.00          0.01

[336 rows x 6 columns]

----------------------------------------------------------------------
Subgroup label:  X360
----------------------------------------------------------------------
     Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
0        X360     14.97      4.94      0.24         1.67         21.82
2        X360      9.63      5.31      0.06         1.38         16.38
3        X360      9.03      4.28      0.13         1.32         14.76
4        X360      9.67      3.73      0.11         1.13         14.64
7        X360      8.25      4.30      0.07         1.12         13.73
...       ...       ...       ...       ...          ...           ...
3127     X360      0.00      0.01      0.00         0.00          0.01
3128     X360      0.00      0.00      0.01         0.00          0.01
3130     X360      0.01      0.00      0.00         0.00          0.01
3135     X360      0.00      0.00      0.01         0.00          0.01
3138     X360      0.00      0.01      0.00         0.00          0.01

[1265 rows x 6 columns]

----------------------------------------------------------------------
Subgroup label:  XOne
----------------------------------------------------------------------
     Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
30       XOne      4.52      2.09      0.01         0.67          7.30
63       XOne      3.21      1.53      0.01         0.38          5.13
65       XOne      2.66      2.01      0.00         0.41          5.08
84       XOne      2.64      1.20      0.03         0.39          4.26
93       XOne      2.45      1.26      0.01         0.37          4.09
...       ...       ...       ...       ...          ...           ...
3133     XOne      0.00      0.01      0.00         0.00          0.01
3134     XOne      0.00      0.01      0.00         0.00          0.01
3139     XOne      0.01      0.00      0.00         0.00          0.01
3140     XOne      0.01      0.00      0.00         0.00          0.01
3142     XOne      0.00      0.01      0.00         0.00          0.01

[213 rows x 6 columns]

In [95]:
# Q: How to access a single (sub)group?

In [96]:
# sales.groupby('Platform')['PS3']

#KeyError: 'Column not found: PS3'

In [97]:
sales.groupby('Platform')['JP_Sales']

In [98]:
type(sales.groupby("Platform")["JP_Sales"])

pandas.core.groupby.generic.SeriesGroupBy

In [99]:
type(sales)

pandas.core.frame.DataFrame

In [100]:
iter(sales.groupby('Platform'))

In [101]:
dict(iter(sales.groupby('Platform')))

{'PS3':      Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
 1         PS3      7.01      9.27      0.97         4.14         21.40
 6         PS3      4.99      5.88      0.65         2.52         14.03
 9         PS3      5.54      5.82      0.49         1.62         13.46
 10        PS3      5.98      4.44      0.48         1.83         12.73
 14        PS3      2.96      4.88      0.81         2.12         10.77
 ...       ...       ...       ...       ...          ...           ...
 3124      PS3      0.00      0.01      0.00         0.00          0.01
 3125      PS3      0.00      0.00      0.01         0.00          0.01
 3129      PS3      0.00      0.00      0.01         0.00          0.01
 3132      PS3      0.00      0.00      0.01         0.00          0.01
 3136      PS3      0.00      0.00      0.01         0.00          0.01

 [1329 rows x 6 columns],
 'PS4':      Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
 5         PS4      5.77      5.81      0.35         2.31         14.24
 12        PS4      3.80      5.81      0.36         2.02         11.98
 24        PS4      1.11      6.06      0.06         1.26          8.49
 26        PS4      2.93      3.29      0.22         1.23          7.67
 27        PS4      2.80      3.30      0.14         1.37          7.60
 ...       ...       ...       ...       ...          ...           ...
 3091      PS4      0.00      0.00      0.01         0.00          0.01
 3101      PS4      0.01      0.00      0.00         0.00          0.01
 3106      PS4      0.00      0.00      0.01         0.00          0.01
 3137      PS4      0.00      0.00      0.01         0.00          0.01
 3141      PS4      0.00      0.01      0.00         0.00          0.01

 [336 rows x 6 columns],
 'X360':      Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
 0        X360     14.97      4.94      0.24         1.67         21.82
 2        X360      9.63      5.31      0.06         1.38         16.38
 3        X360      9.03      4.28      0.13         1.32         14.76
 4        X360      9.67      3.73      0.11         1.13         14.64
 7        X360      8.25      4.30      0.07         1.12         13.73
 ...       ...       ...       ...       ...          ...           ...
 3127     X360      0.00      0.01      0.00         0.00          0.01
 3128     X360      0.00      0.00      0.01         0.00          0.01
 3130     X360      0.01      0.00      0.00         0.00          0.01
 3135     X360      0.00      0.00      0.01         0.00          0.01
 3138     X360      0.00      0.01      0.00         0.00          0.01

 [1265 rows x 6 columns],
 'XOne':      Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
 30       XOne      4.52      2.09      0.01         0.67          7.30
 63       XOne      3.21      1.53      0.01         0.38          5.13
 65       XOne      2.66      2.01      0.00         0.41          5.08
 84       XOne      2.64      1.20      0.03         0.39          4.26
 93       XOne      2.45      1.26      0.01         0.37          4.09
 ...       ...       ...       ...       ...          ...           ...
 3133     XOne      0.00      0.01      0.00         0.00          0.01
 3134     XOne      0.00      0.01      0.00         0.00          0.01
 3139     XOne      0.01      0.00      0.00         0.00          0.01
 3140     XOne      0.01      0.00      0.00         0.00          0.01
 3142     XOne      0.00      0.01      0.00         0.00          0.01

 [213 rows x 6 columns]}

In [102]:
dict(iter(sales.groupby('Platform')))['PS3']

     Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
1         PS3      7.01      9.27      0.97         4.14         21.40
6         PS3      4.99      5.88      0.65         2.52         14.03
9         PS3      5.54      5.82      0.49         1.62         13.46
10        PS3      5.98      4.44      0.48         1.83         12.73
14        PS3      2.96      4.88      0.81         2.12         10.77
...       ...       ...       ...       ...          ...           ...
3124      PS3      0.00      0.01      0.00         0.00          0.01
3125      PS3      0.00      0.00      0.01         0.00          0.01
3129      PS3      0.00      0.00      0.01         0.00          0.01
3132      PS3      0.00      0.00      0.01         0.00          0.01
3136      PS3      0.00      0.00      0.01         0.00          0.01

[1329 rows x 6 columns]

In [103]:
sales.groupby('Platform').get_group('PS3')

     Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
1         PS3      7.01      9.27      0.97         4.14         21.40
6         PS3      4.99      5.88      0.65         2.52         14.03
9         PS3      5.54      5.82      0.49         1.62         13.46
10        PS3      5.98      4.44      0.48         1.83         12.73
14        PS3      2.96      4.88      0.81         2.12         10.77
...       ...       ...       ...       ...          ...           ...
3124      PS3      0.00      0.01      0.00         0.00          0.01
3125      PS3      0.00      0.00      0.01         0.00          0.01
3129      PS3      0.00      0.00      0.01         0.00          0.01
3132      PS3      0.00      0.00      0.01         0.00          0.01
3136      PS3      0.00      0.00      0.01         0.00          0.01

[1329 rows x 6 columns]

In [104]:
sales.groupby('Platform').get_group('PS3') == dict(iter(sales.groupby('Platform')))['PS3']

      Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
1         True      True      True      True         True          True
6         True      True      True      True         True          True
9         True      True      True      True         True          True
10        True      True      True      True         True          True
14        True      True      True      True         True          True
...        ...       ...       ...       ...          ...           ...
3124      True      True      True      True         True          True
3125      True      True      True      True         True          True
3129      True      True      True      True         True          True
3132      True      True      True      True         True          True
3136      True      True      True      True         True          True

[1329 rows x 6 columns]

In [105]:
sales.groupby('Platform').get_group('PS3').isin( dict(iter(sales.groupby('Platform')))['PS3'])

      Platform  NA_Sales  EU_Sales  JP_Sales  Other_Sales  Global_Sales
1         True      True      True      True         True          True
6         True      True      True      True         True          True
9         True      True      True      True         True          True
10        True      True      True      True         True          True
14        True      True      True      True         True          True
...        ...       ...       ...       ...          ...           ...
3124      True      True      True      True         True          True
3125      True      True      True      True         True          True
3129      True      True      True      True         True          True
3132      True      True      True      True         True          True
3136      True      True      True      True         True          True

[1329 rows x 6 columns]

In [106]:
(sales.groupby('Platform').get_group('PS3').isin( dict(iter(sales.groupby('Platform')))['PS3']) == True).count()

Platform        1329
NA_Sales        1329
EU_Sales        1329
JP_Sales        1329
Other_Sales     1329
Global_Sales    1329
dtype: int64

In [107]:
sales.groupby('Platform').size()

Platform
PS3     1329
PS4      336
X360    1265
XOne     213
dtype: int64

# 207. Multindex grouping

In [108]:
games.head(n=2)

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,Kinect Adventures!,X360,2010.0,Misc,Microsoft Game Studios,14.97,4.94,0.24,1.67,21.82
1,Grand Theft Auto V,PS3,2013.0,Action,Take-Two Interactive,7.01,9.27,0.97,4.14,21.40

In [109]:
studios_key = ['Genre','Publisher','Global_Sales']
studios = games.loc[:,studios_key]

In [110]:
studios.head(n=2)

    Genre               Publisher  Global_Sales
0    Misc  Microsoft Game Studios         21.82
1  Action    Take-Two Interactive         21.40

In [111]:
studios.groupby('Publisher').sum()

                   Global_Sales
Publisher
49Games                    0.04
505 Games                 15.80
5pb                        0.79
Abylight                   0.08
Ackkstudios                0.41
...                         ...
Yacht Club Games           0.08
Yeti                       0.03
Zoo Games                  0.32
Zushi Games                0.23
bitComposer Games          0.27

[155 rows x 1 columns]

In [112]:
# Q: Which are the top publishers by global sales?

In [113]:
studios.groupby('Publisher').sum().sort_values(by='Global_Sales', ascending=False)

                        Global_Sales
Publisher
Electronic Arts               434.41
Activision                    349.22
Take-Two Interactive          218.08
Ubisoft                       201.98
Microsoft Game Studios        190.56
...                              ...
UIG Entertainment               0.01
ChunSoft                        0.01
Kaga Create                     0.01
Epic Games                      0.01
Ongakukan                       0.01

[155 rows x 1 columns]

In [114]:
# Q2: Which are the top publishers within each genre by global sales?

In [115]:
studios.head(n=2)

    Genre               Publisher  Global_Sales
0    Misc  Microsoft Game Studios         21.82
1  Action    Take-Two Interactive         21.40

In [116]:
studios_groupby = ['Genre','Publisher']
studios.groupby(studios_groupby).sum().sort_values(by=studios_groupby, ascending=[True,False])

                                                 Global_Sales
Genre    Publisher
Action   Yeti                                            0.01
         Warner Bros. Interactive Entertainment         71.89
         Vivendi Games                                   1.40
         Unknown                                         0.18
         Ubisoft Annecy                                  2.60
...                                                       ...
Strategy Banpresto                                       0.01
         Aqua Plus                                       0.12
         Activision                                      0.98
         Ackkstudios                                     0.01
         505 Games                                       0.09

[422 rows x 1 columns]

In [117]:
studios.groupby(studios_groupby).sum().sort_values(by='Global_Sales', ascending=False)

                                         Global_Sales
Genre        Publisher
Shooter      Activision                        245.46
Sports       Electronic Arts                   203.50
Action       Take-Two Interactive              106.04
             Ubisoft                            96.44
Shooter      Electronic Arts                    92.58
...                                               ...
Adventure    Cave                                0.01
Role-Playing TopWare Interactive                 0.01
Sports       Interworks Unlimited, Inc.          0.01
Strategy     Ackkstudios                         0.01
Adventure    Views                               0.01

[422 rows x 1 columns]

In [118]:
studios.groupby(studios_groupby).sum().sort_values(by=['Genre','Global_Sales'],ascending=[True,False])

                                                 Global_Sales
Genre    Publisher
Action   Take-Two Interactive                          106.04
         Ubisoft                                        96.44
         Warner Bros. Interactive Entertainment         71.89
         Sony Computer Entertainment                    60.38
         Electronic Arts                                49.61
...                                                       ...
Strategy Sony Computer Entertainment                     0.03
         CyberFront                                      0.02
         D3Publisher                                     0.02
         Ackkstudios                                     0.01
         Banpresto                                       0.01

[422 rows x 1 columns]

In [119]:
studios.groupby(studios_groupby).sum().sort_values(by='Global_Sales',ascending=False)

                                         Global_Sales
Genre        Publisher
Shooter      Activision                        245.46
Sports       Electronic Arts                   203.50
Action       Take-Two Interactive              106.04
             Ubisoft                            96.44
Shooter      Electronic Arts                    92.58
...                                               ...
Adventure    Cave                                0.01
Role-Playing TopWare Interactive                 0.01
Sports       Interworks Unlimited, Inc.          0.01
Strategy     Ackkstudios                         0.01
Adventure    Views                               0.01

[422 rows x 1 columns]

In [120]:
studios.groupby(studios_groupby).aggregate('sum')

                               Global_Sales
Genre    Publisher
Action   505 Games                     2.25
         Abylight                      0.08
         Ackkstudios                   0.33
         Acquire                       0.11
         Activision                   42.84
...                                     ...
Strategy Square Enix                   0.35
         Takara Tomy                   0.09
         Take-Two Interactive          2.92
         Tecmo Koei                    0.58
         Ubisoft                       2.34

[422 rows x 1 columns]

In [121]:
studios.groupby(studios_groupby).agg('sum') # 'median', 'mean', 'std'...

                               Global_Sales
Genre    Publisher
Action   505 Games                     2.25
         Abylight                      0.08
         Ackkstudios                   0.33
         Acquire                       0.11
         Activision                   42.84
...                                     ...
Strategy Square Enix                   0.35
         Takara Tomy                   0.09
         Take-Two Interactive          2.92
         Tecmo Koei                    0.58
         Ubisoft                       2.34

[422 rows x 1 columns]

In [122]:
studios.groupby(studios_groupby).agg(np.sum)

                               Global_Sales
Genre    Publisher
Action   505 Games                     2.25
         Abylight                      0.08
         Ackkstudios                   0.33
         Acquire                       0.11
         Activision                   42.84
...                                     ...
Strategy Square Enix                   0.35
         Takara Tomy                   0.09
         Take-Two Interactive          2.92
         Tecmo Koei                    0.58
         Ubisoft                       2.34

[422 rows x 1 columns]

In [123]:
# specifying multiple functions

In [124]:
# Q: summarize the sum, count, average and standard dev of sales as well as the number of games published by each publisher within each genre.

In [125]:
studios.groupby(studios_groupby).agg(['sum','mean','std','count'])

                              Global_Sales
                                       sum      mean       std count
Genre    Publisher
Action   505 Games                    2.25  0.281250  0.266482     8
         Abylight                     0.08  0.080000       NaN     1
         Ackkstudios                  0.33  0.330000       NaN     1
         Acquire                      0.11  0.110000       NaN     1
         Activision                  42.84  0.450947  0.559717    95
...                                    ...       ...       ...   ...
Strategy Square Enix                  0.35  0.350000       NaN     1
         Takara Tomy                  0.09  0.090000       NaN     1
         Take-Two Interactive         2.92  0.486667  0.364289     6
         Tecmo Koei                   0.58  0.096667  0.055015     6
         Ubisoft                      2.34  0.585000  0.267519     4

[422 rows x 4 columns]

In [126]:
studios_aggregation = ['sum','mean','std','count']
studios.groupby(studios_groupby).agg(studios_aggregation).sort_values(by=studios_groupby, ascending=[False,True])

                                                Global_Sales            \
                                                         sum      mean
Genre    Publisher
Strategy 505 Games                                      0.09  0.090000
         Ackkstudios                                    0.01  0.010000
         Activision                                     0.98  0.245000
         Aqua Plus                                      0.12  0.060000
         Banpresto                                      0.01  0.010000
...                                                      ...       ...
Action   Ubisoft Annecy                                 2.60  0.433333
         Unknown                                        0.18  0.090000
         Vivendi Games                                  1.40  0.280000
         Warner Bros. Interactive Entertainment        71.89  1.027000
         Yeti                                           0.01  0.010000


                                                      std count
Genre    Publisher
Strategy 505 Games                                    NaN     1
         Ackkstudios                                  NaN     1
         Activision                              0.078528     4
         Aqua Plus                               0.028284     2
         Banpresto                                    NaN     1
...                                                   ...   ...
Action   Ubisoft Annecy                          0.317406     6
         Unknown                                 0.098995     2
         Vivendi Games                           0.148155     5
         Warner Bros. Interactive Entertainment  1.046230    70
         Yeti                                         NaN     1

[422 rows x 4 columns]

In [127]:
studios.groupby(studios_groupby).agg(studios_aggregation).columns

MultiIndex([('Global_Sales',   'sum'),
            ('Global_Sales',  'mean'),
            ('Global_Sales',   'std'),
            ('Global_Sales', 'count')],
           )

In [128]:
studios.groupby(studios_groupby).agg(studios_aggregation).sort_values(by=('Global_Sales', 'count'),ascending=False)

                                                Global_Sales            \
                                                         sum      mean
Genre    Publisher
Sports   Electronic Arts                              203.50  1.197059
Action   Activision                                    42.84  0.450947
Sports   Take-Two Interactive                          56.89  0.748553
Shooter  Activision                                   245.46  3.409167
Action   Warner Bros. Interactive Entertainment        71.89  1.027000
...                                                      ...       ...
Shooter  Valve Software                                 2.10  2.100000
Action   Yeti                                           0.01  0.010000
Shooter  Xseed Games                                    0.05  0.050000
Fighting Majesco Entertainment                          0.07  0.070000
Misc     Irem Software Engineering                      0.02  0.020000


                                                      std count
Genre    Publisher
Sports   Electronic Arts                         1.404108   170
Action   Activision                              0.559717    95
Sports   Take-Two Interactive                    0.811132    76
Shooter  Activision                              4.621920    72
Action   Warner Bros. Interactive Entertainment  1.046230    70
...                                                   ...   ...
Shooter  Valve Software                               NaN     1
Action   Yeti                                         NaN     1
Shooter  Xseed Games                                  NaN     1
Fighting Majesco Entertainment                        NaN     1
Misc     Irem Software Engineering                    NaN     1

[422 rows x 4 columns]

In [129]:
games.loc[games.Publisher == 'Activision'].sort_values(by='Global_Sales', ascending=False)

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
3,Call of Duty: Modern Warfare 3,X360,2011.0,Shooter,Activision,9.03,4.28,0.13,1.32,14.76
4,Call of Duty: Black Ops,X360,2010.0,Shooter,Activision,9.67,3.73,0.11,1.13,14.64
5,Call of Duty: Black Ops 3,PS4,2015.0,Shooter,Activision,5.77,5.81,0.35,2.31,14.24
6,Call of Duty: Black Ops II,PS3,2012.0,Shooter,Activision,4.99,5.88,0.65,2.52,14.03
7,Call of Duty: Black Ops II,X360,2012.0,Shooter,Activision,8.25,4.30,0.07,1.12,13.73
...,...,...,...,...,...,...,...,...,...,...
2923,Ghostbusters (2016),XOne,2016.0,Action,Activision,0.02,0.00,0.00,0.00,0.02
2932,The Voice,PS3,2014.0,Action,Activision,0.02,0.00,0.00,0.00,0.02
2935,Rapala for Kinect,X360,2011.0,Sports,Activision,0.00,0.02,0.00,0.00,0.02
3012,Call of Duty: Modern Warfare Trilogy,PS3,2016.0,Shooter,Activision,0.00,0.01,0.00,0.00,0.02
3035,Call of Duty: Modern Warfare Trilogy,X360,2016.0,Shooter,Activision,0.01,0.01,0.00,0.00,0.02

In [130]:
studios.groupby(studios_groupby).agg(studios_aggregation).rename({'sum':'Total_revenue','count':'number_games'},axis=1)

                               Global_Sales
                              Total_revenue      mean       std number_games
Genre    Publisher
Action   505 Games                     2.25  0.281250  0.266482            8
         Abylight                      0.08  0.080000       NaN            1
         Ackkstudios                   0.33  0.330000       NaN            1
         Acquire                       0.11  0.110000       NaN            1
         Activision                   42.84  0.450947  0.559717           95
...                                     ...       ...       ...          ...
Strategy Square Enix                   0.35  0.350000       NaN            1
         Takara Tomy                   0.09  0.090000       NaN            1
         Take-Two Interactive          2.92  0.486667  0.364289            6
         Tecmo Koei                    0.58  0.096667  0.055015            6
         Ubisoft                       2.34  0.585000  0.267519            4

[422 rows x 4 columns]

In [131]:
# named aggregations

In [132]:
studios.groupby(studios_groupby).agg(
    Total_revenue=('Global_Sales','sum'), 
    Number_of_games=('Global_Sales',np.mean),
    Revenue_std=('Global_Sales','std'),
    Revenue_avg=('Global_Sales','mean')
    ).sort_values(by='Total_revenue',ascending=False)

                                         Total_revenue  Number_of_games  \
Genre        Publisher
Shooter      Activision                         245.46         3.409167
Sports       Electronic Arts                    203.50         1.197059
Action       Take-Two Interactive               106.04         4.610435
             Ubisoft                             96.44         1.439403
Shooter      Electronic Arts                     92.58         1.851600
...                                                ...              ...
Adventure    Cave                                 0.01         0.010000
Role-Playing TopWare Interactive                  0.01         0.010000
Sports       Interworks Unlimited, Inc.           0.01         0.010000
Strategy     Ackkstudios                          0.01         0.010000
Adventure    Views                                0.01         0.010000

                                         Revenue_std  Revenue_avg
Genre        Publisher
Shooter      Activision                     4.621920     3.409167
Sports       Electronic Arts                1.404108     1.197059
Action       Take-Two Interactive           5.843768     4.610435
             Ubisoft                        1.636460     1.439403
Shooter      Electronic Arts                1.794404     1.851600
...                                              ...          ...
Adventure    Cave                                NaN     0.010000
Role-Playing TopWare Interactive                 NaN     0.010000
Sports       Interworks Unlimited, Inc.          NaN     0.010000
Strategy     Ackkstudios                         NaN     0.010000
Adventure    Views                               NaN     0.010000

[422 rows x 4 columns]

In [133]:
games.groupby(studios_groupby).agg(
    total_global_revenue=('Global_Sales','sum'),
    EU_revenue=('EU_Sales','sum'),
    average_EU_revenue=('EU_Sales','mean')
    ).sort_values(by='EU_revenue',ascending=False)

                                         total_global_revenue  EU_revenue  \
Genre        Publisher
Shooter      Activision                                245.46       81.50
Sports       Electronic Arts                           203.50       77.19
Action       Take-Two Interactive                      106.04       39.77
             Ubisoft                                    96.44       36.24
Shooter      Electronic Arts                            92.58       31.94
...                                                       ...         ...
Role-Playing Idea Factory International                  0.11        0.00
             Marvelous Interactive                       0.22        0.00
Action       Unknown                                     0.18        0.00
Role-Playing Nihon Falcom Corporation                    0.02        0.00
Racing       Evolved Games                               0.13        0.00

                                         average_EU_revenue
Genre        Publisher
Shooter      Activision                            1.131944
Sports       Electronic Arts                       0.454059
Action       Take-Two Interactive                  1.729130
             Ubisoft                               0.540896
Shooter      Electronic Arts                       0.638800
...                                                     ...
Role-Playing Idea Factory International            0.000000
             Marvelous Interactive                 0.000000
Action       Unknown                               0.000000
Role-Playing Nihon Falcom Corporation              0.000000
Racing       Evolved Games                         0.000000

[422 rows x 3 columns]

In [134]:
#perhaps even better:

In [135]:
games.groupby(studios_groupby).agg(
    {
        'Global_Sales':'sum',
        'EU_Sales':'mean'
    }
).sort_values(by='EU_Sales',ascending=False)

                                                 Global_Sales  EU_Sales
Genre        Publisher
Action       Sony Computer Entertainment Europe          5.99  2.280000
             Take-Two Interactive                      106.04  1.729130
Racing       Sony Computer Entertainment                28.17  1.334000
Role-Playing Bethesda Softworks                         46.00  1.298333
Adventure    Take-Two Interactive                        5.95  1.135000
...                                                       ...       ...
Role-Playing Idea Factory International                  0.11  0.000000
             Marvelous Interactive                       0.22  0.000000
             Nihon Falcom Corporation                    0.02  0.000000
             Nordic Games                                0.05  0.000000
Racing       Evolved Games                               0.13  0.000000

[422 rows x 2 columns]

# 210. The filter() method

In [136]:
# groupby() + agg() is not the only game in town.

In [137]:
#Q: find all games whose publisher has sold more than 50M in North America within the game's genre

In [138]:
games.head(n=2)

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,Kinect Adventures!,X360,2010.0,Misc,Microsoft Game Studios,14.97,4.94,0.24,1.67,21.82
1,Grand Theft Auto V,PS3,2013.0,Action,Take-Two Interactive,7.01,9.27,0.97,4.14,21.40

In [139]:
games.groupby(studios_groupby).filter(lambda sg: sg['NA_Sales'].sum() > 50)

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
3,Call of Duty: Modern Warfare 3,X360,2011.0,Shooter,Activision,9.03,4.28,0.13,1.32,14.76
4,Call of Duty: Black Ops,X360,2010.0,Shooter,Activision,9.67,3.73,0.11,1.13,14.64
5,Call of Duty: Black Ops 3,PS4,2015.0,Shooter,Activision,5.77,5.81,0.35,2.31,14.24
6,Call of Duty: Black Ops II,PS3,2012.0,Shooter,Activision,4.99,5.88,0.65,2.52,14.03
7,Call of Duty: Black Ops II,X360,2012.0,Shooter,Activision,8.25,4.30,0.07,1.12,13.73
...,...,...,...,...,...,...,...,...,...,...
2908,Cabela's Big Game Hunter: Pro Hunts,X360,2014.0,Shooter,Activision,0.02,0.00,0.00,0.00,0.03
3012,Call of Duty: Modern Warfare Trilogy,PS3,2016.0,Shooter,Activision,0.00,0.01,0.00,0.00,0.02
3033,NHL 16,X360,2015.0,Sports,Electronic Arts,0.00,0.02,0.00,0.00,0.02
3035,Call of Duty: Modern Warfare Trilogy,X360,2016.0,Shooter,Activision,0.01,0.01,0.00,0.00,0.02
3078,Madden NFL 13,PS3,2012.0,Sports,Electronic Arts,0.00,0.01,0.00,0.00,0.01

In [140]:
M = games.groupby(studios_groupby).filter(lambda sg: sg['NA_Sales'].sum() > 50)

In [141]:
M.head()

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
3,Call of Duty: Modern Warfare 3,X360,2011.0,Shooter,Activision,9.03,4.28,0.13,1.32,14.76
4,Call of Duty: Black Ops,X360,2010.0,Shooter,Activision,9.67,3.73,0.11,1.13,14.64
5,Call of Duty: Black Ops 3,PS4,2015.0,Shooter,Activision,5.77,5.81,0.35,2.31,14.24
6,Call of Duty: Black Ops II,PS3,2012.0,Shooter,Activision,4.99,5.88,0.65,2.52,14.03
7,Call of Duty: Black Ops II,X360,2012.0,Shooter,Activision,8.25,4.30,0.07,1.12,13.73

In [142]:
M.groupby(by='Publisher').sum()

,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
Publisher,,,,,,
Activision,142800.0,129.77,81.50,4.60,29.48,245.46
Electronic Arts,339823.0,99.73,77.19,1.05,25.47,203.50
Microsoft Game Studios,36184.0,50.27,19.18,0.74,6.82,77.02

In [143]:
M = games.groupby(by='Publisher').filter(lambda sg: sg['EU_Sales'].sum() > 50)

In [144]:
M.groupby(by='Publisher').sum()

,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
Publisher,,,,,,
Activision,567066.0,193.16,109.71,4.99,41.26,349.22
Electronic Arts,721774.0,213.38,161.48,4.81,54.63,434.41
Microsoft Game Studios,182930.0,116.77,54.83,2.34,16.66,190.56
Sony Computer Entertainment,291507.0,76.35,65.53,8.08,26.66,176.69
Take-Two Interactive,295578.0,120.99,66.70,3.80,26.66,218.08
Ubisoft,440409.0,98.65,73.87,3.74,25.70,201.98

In [145]:
type(M)

pandas.core.frame.DataFrame

In [146]:
M.groupby('Publisher').sum().loc[:,'EU_Sales']

Publisher
Activision                     109.71
Electronic Arts                161.48
Microsoft Game Studios          54.83
Sony Computer Entertainment     65.53
Take-Two Interactive            66.70
Ubisoft                         73.87
Name: EU_Sales, dtype: float64

In [147]:
def more_than_50(df):
    return df['EU_Sales'].sum()>50

In [148]:
games.head(n=1)

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,Kinect Adventures!,X360,2010.0,Misc,Microsoft Game Studios,14.97,4.94,0.24,1.67,21.82

In [149]:
games.groupby(studios_groupby).filter(more_than_50)

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
3,Call of Duty: Modern Warfare 3,X360,2011.0,Shooter,Activision,9.03,4.28,0.13,1.32,14.76
4,Call of Duty: Black Ops,X360,2010.0,Shooter,Activision,9.67,3.73,0.11,1.13,14.64
5,Call of Duty: Black Ops 3,PS4,2015.0,Shooter,Activision,5.77,5.81,0.35,2.31,14.24
6,Call of Duty: Black Ops II,PS3,2012.0,Shooter,Activision,4.99,5.88,0.65,2.52,14.03
7,Call of Duty: Black Ops II,X360,2012.0,Shooter,Activision,8.25,4.30,0.07,1.12,13.73
...,...,...,...,...,...,...,...,...,...,...
2908,Cabela's Big Game Hunter: Pro Hunts,X360,2014.0,Shooter,Activision,0.02,0.00,0.00,0.00,0.03
3012,Call of Duty: Modern Warfare Trilogy,PS3,2016.0,Shooter,Activision,0.00,0.01,0.00,0.00,0.02
3033,NHL 16,X360,2015.0,Sports,Electronic Arts,0.00,0.02,0.00,0.00,0.02
3035,Call of Duty: Modern Warfare Trilogy,X360,2016.0,Shooter,Activision,0.01,0.01,0.00,0.00,0.02
3078,Madden NFL 13,PS3,2012.0,Sports,Electronic Arts,0.00,0.01,0.00,0.00,0.01

In [150]:
what = 'EU_Sales'
how_many = 50
games.groupby(studios_groupby).filter(lambda sg: sg[what].sum() > how_many).groupby('Publisher').sum()

,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
Publisher,,,,,,
Activision,142800.0,129.77,81.50,4.60,29.48,245.46
Electronic Arts,339823.0,99.73,77.19,1.05,25.47,203.50

In [151]:
games.groupby('Publisher').filter(lambda sg: sg[what].sum() > how_many).groupby('Publisher').sum().loc[:,what]

Publisher
Activision                     109.71
Electronic Arts                161.48
Microsoft Game Studios          54.83
Sony Computer Entertainment     65.53
Take-Two Interactive            66.70
Ubisoft                         73.87
Name: EU_Sales, dtype: float64

In [152]:
games.size

31430

# 211. GroupBy Transformations

In [153]:
# groupby() + transform() for inplace transformation applied at subgroup level

In [154]:
games.head()

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,Kinect Adventures!,X360,2010.0,Misc,Microsoft Game Studios,14.97,4.94,0.24,1.67,21.82
1,Grand Theft Auto V,PS3,2013.0,Action,Take-Two Interactive,7.01,9.27,0.97,4.14,21.40
2,Grand Theft Auto V,X360,2013.0,Action,Take-Two Interactive,9.63,5.31,0.06,1.38,16.38
3,Call of Duty: Modern Warfare 3,X360,2011.0,Shooter,Activision,9.03,4.28,0.13,1.32,14.76
4,Call of Duty: Black Ops,X360,2010.0,Shooter,Activision,9.67,3.73,0.11,1.13,14.64

In [155]:
# ===ASIDE

In [156]:
game_sale = 5
game_genre_avg = 0.5
game_genre_std = 0.1

In [157]:
(game_sale - game_genre_avg) / game_genre_std

45.0

In [158]:
game_sale = 5
game_genre_avg = 5.05
game_genre_std = 0.1

(game_sale - game_genre_avg) / game_genre_std

-0.4999999999999982

In [159]:
# ===END ASIDE

In [160]:
# Q: convert raw global_sales to within-genre standard scores

In [161]:
games.columns

Index(['Name', 'Platform', 'Year', 'Genre', 'Publisher', 'NA_Sales',
       'EU_Sales', 'JP_Sales', 'Other_Sales', 'Global_Sales'],
      dtype='object')

In [162]:
revative = ['Name', 'Genre','Platform','Global_Sales']
games_relative = games.loc[:,revative]

In [163]:
games_relative.set_index(['Name','Platform'])

                                                Genre  Global_Sales
Name                           Platform
Kinect Adventures!             X360              Misc         21.82
Grand Theft Auto V             PS3             Action         21.40
                               X360            Action         16.38
Call of Duty: Modern Warfare 3 X360           Shooter         14.76
Call of Duty: Black Ops        X360           Shooter         14.64
...                                               ...           ...
Bound By Flame                 X360      Role-Playing          0.01
Mighty No. 9                   XOne          Platform          0.01
Resident Evil 4 HD             XOne           Shooter          0.01
Farming 2017 - The Simulation  PS4         Simulation          0.01
Rugby Challenge 3              XOne            Sports          0.01

[3143 rows x 2 columns]

In [164]:
games_relative.set_index(['Name','Platform']).groupby('Genre').transform(lambda x: (x-x.mean())/x.std()).sort_values(by='Global_Sales', ascending=False).head(n=11)

                                      Global_Sales
Name                        Platform
Grand Theft Auto V          PS3          13.831175
Kinect Adventures!          X360         13.814162
Grand Theft Auto V          X360         10.468663
Gran Turismo 5              PS3           9.159261
Grand Theft Auto V          PS4           7.521441
FIFA 16                     PS4           7.481599
Assassin's Creed            X360          7.000927
Grand Theft Auto IV         X360          6.878410
The Elder Scrolls V: Skyrim X360          6.640951
Grand Theft Auto IV         PS3           6.576990
Halo Wars                   X360          6.247597

In [165]:
# .groupby() + ...
# .agg() -> (typicaly) reduces the dimension of the dataset
# .filter() -> include/exclude without changing the dimensions
# .transform() -> change the values in place without altering the shape

# 212. Theres also apply()

In [166]:
#groupby() + apply(): the generic, "do it youself" alternative

In [167]:
games.columns

Index(['Name', 'Platform', 'Year', 'Genre', 'Publisher', 'NA_Sales',
       'EU_Sales', 'JP_Sales', 'Other_Sales', 'Global_Sales'],
      dtype='object')

In [168]:
ps3_filter = ['Name','Genre','EU_Sales','Global_Sales']
ps3 = games.loc[games.Platform == 'PS3',ps3_filter]

In [169]:
ps3

,Name,Genre,EU_Sales,Global_Sales
1,Grand Theft Auto V,Action,9.27,21.40
6,Call of Duty: Black Ops II,Shooter,5.88,14.03
9,Call of Duty: Modern Warfare 3,Shooter,5.82,13.46
10,Call of Duty: Black Ops,Shooter,4.44,12.73
14,Gran Turismo 5,Racing,4.88,10.77
...,...,...,...,...
3124,Hyperdimension Neptunia mk2,Action,0.01,0.01
3125,Shin Koihime Musou: Otome Taisen * Sangokushi ...,Adventure,0.00,0.01
3129,Muv-Luv Alternative,Simulation,0.00,0.01
3132,Akatsuki no Goei Trinity,Adventure,0.00,0.01
3136,Battle Fantasia,Fighting,0.00,0.01

In [170]:
# the paradigm: subgroup -> apply -> output

In [171]:
ps3.groupby('Genre').apply(lambda sg: 'solid' if sg.EU_Sales.sum() > 50 else 'weak')

Genre
Action          solid
Adventure        weak
Fighting         weak
Misc             weak
Platform         weak
Puzzle           weak
Racing           weak
Role-Playing     weak
Shooter         solid
Simulation       weak
Sports           weak
Strategy         weak
dtype: object

In [172]:
# our target syntax: ps3.groupby('Genre).apply(sales_detail)

In [173]:
def sales_detail(sg):
    level = 'solid' if sg.EU_Sales.sum() > 50 else 'weak'
    variability = 'volatile' if sg.EU_Sales.std()/sg.EU_Sales.mean() > 2 else 'steady'
    return (variability, level + ' sales')

In [174]:
ps3.groupby('Genre').apply(sales_detail)

Genre
Action          (volatile, solid sales)
Adventure        (volatile, weak sales)
Fighting           (steady, weak sales)
Misc               (steady, weak sales)
Platform           (steady, weak sales)
Puzzle             (steady, weak sales)
Racing             (steady, weak sales)
Role-Playing     (volatile, weak sales)
Shooter           (steady, solid sales)
Simulation         (steady, weak sales)
Sports           (volatile, weak sales)
Strategy           (steady, weak sales)
dtype: object

In [175]:
ps3.groupby('Genre').apply(lambda x: print(x.info(), '\n'))

<class 'pandas.core.frame.DataFrame'>
Int64Index: 380 entries, 1 to 3124
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          380 non-null    object
 1   Genre         380 non-null    object
 2   EU_Sales      380 non-null    float64
 3   Global_Sales  380 non-null    float64
dtypes: float64(2), object(2)
memory usage: 14.8+ KB
None

<class 'pandas.core.frame.DataFrame'>
Int64Index: 74 entries, 70 to 3132
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          74 non-null     object
 1   Genre         74 non-null     object
 2   EU_Sales      74 non-null     float64
 3   Global_Sales  74 non-null     float64
dtypes: float64(2), object(2)
memory usage: 2.9+ KB
None

<class 'pandas.core.frame.DataFrame'>
Int64Index: 76 entries, 90 to 3136
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          76 non-null     object
 1   Genre         76 non-null     object
 2   EU_Sales      76 non-null     float64
 3   Global_Sales  76 non-null     float64
dtypes: float64(2), object(2)
memory usage: 3.0+ KB
None

<class 'pandas.core.frame.DataFrame'>
Int64Index: 124 entries, 57 to 3096
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          124 non-null    object
 1   Genre         124 non-null    object
 2   EU_Sales      124 non-null    float64
 3   Global_Sales  124 non-null    float64
dtypes: float64(2), object(2)
memory usage: 4.8+ KB
None

<class 'pandas.core.frame.DataFrame'>
Int64Index: 37 entries, 50 to 3098
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          37 non-null     object
 1   Genre         37 non-null     object
 2   EU_Sales      37 non-null     float64
 3   Global_Sales  37 non-null     float64
dtypes: float64(2), object(2)
memory usage: 1.4+ KB
None

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 1246 to 2744
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          3 non-null      object
 1   Genre         3 non-null      object
 2   EU_Sales      3 non-null      float64
 3   Global_Sales  3 non-null      float64
dtypes: float64(2), object(2)
memory usage: 120.0+ bytes
None

<class 'pandas.core.frame.DataFrame'>
Int64Index: 92 entries, 14 to 3017
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          92 non-null     object
 1   Genre         92 non-null     object
 2   EU_Sales      92 non-null     float64
 3   Global_Sales  92 non-null     float64
dtypes: float64(2), object(2)
memory usage: 3.6+ KB
None

<class 'pandas.core.frame.DataFrame'>
Int64Index: 119 entries, 41 to 3100
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          119 non-null    object
 1   Genre         119 non-null    object
 2   EU_Sales      119 non-null    float64
 3   Global_Sales  119 non-null    float64
dtypes: float64(2), object(2)
memory usage: 4.6+ KB
None

<class 'pandas.core.frame.DataFrame'>
Int64Index: 156 entries, 6 to 3085
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          156 non-null    object
 1   Genre         156 non-null    object
 2   EU_Sales      156 non-null    float64
 3   Global_Sales  156 non-null    float64
dtypes: float64(2), object(2)
memory usage: 6.1+ KB
None

<class 'pandas.core.frame.DataFrame'>
Int64Index: 31 entries, 262 to 3129
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          31 non-null     object
 1   Genre         31 non-null     object
 2   EU_Sales      31 non-null     float64
 3   Global_Sales  31 non-null     float64
dtypes: float64(2), object(2)
memory usage: 1.2+ KB
None

<class 'pandas.core.frame.DataFrame'>
Int64Index: 213 entries, 33 to 3107
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          213 non-null    object
 1   Genre         213 non-null    object
 2   EU_Sales      213 non-null    float64
 3   Global_Sales  213 non-null    float64
dtypes: float64(2), object(2)
memory usage: 8.3+ KB
None

<class 'pandas.core.frame.DataFrame'>
Int64Index: 24 entries, 774 to 3057
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          24 non-null     object
 1   Genre         24 non-null     object
 2   EU_Sales      24 non-null     float64
 3   Global_Sales  24 non-null     float64
dtypes: float64(2), object(2)
memory usage: 960.0+ bytes
None

Empty DataFrame
Columns: []
Index: []